app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers"

  def create
    @register = Register.new(register_params)

    respond_to do |format|
      if @register.save
---
INSERT INTO "registers" ("name", "office", "email", "phone", "sector", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "d"], ["office", "dds"], ["email", "dsd"], ["phone", "ad"], ["sector", "aads"], ["created_at", "2017-08-28 19:35:58.753815"], ["updated_at", "2017-08-28 19:35:58.753815"]]

    def set_register
      @register = Register.find(params[:id])
---
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", 1]]